ConnectTest/src/Catalogs/Токены/Токены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Токены</name>
  <attributes>
    <name>ВидПриложения</name>
    <type>
      <types>EnumRef.ВидыПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.ОперационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Сети</types>
    </type>
  </attributes>
  <attributes>
    <name>Холдинг</name>
    <type>
      <types>CatalogRef.Холдинги</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/InformationRegisters/ЗарегистрированныеУстройства/ЗарегистрированныеУстройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗарегистрированныеУстройства</name>
  <resources>
    <name>ВерсияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МодельУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТокенУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Токен</name>
    <type>
      <types>CatalogRef.Токены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/Enums/ТипыРегистрации/ТипыРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРегистрации</name>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>УдалениеРегистрации</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/Токены/ManagerModule.bsl
Функция ТокенПользователя(ДанныеЗапроса, Пользователь, Сеть, Холдинг, ЧасовойПояс) Экспорт
	ТокенОбъект	= Справочники.Токены.СоздатьЭлемент();
	ТокенОбъект.ДатаСоздания		= УниверсальноеВремя(ТекущаяДата());
	ТокенОбъект.Пользователь		= Пользователь;
	ТокенОбъект.Холдинг				= Холдинг;
	ТокенОбъект.Сеть				= Сеть;
	ТокенОбъект.ЧасовойПояс			= ЧасовойПояс;
	ТокенОбъект.ВидПриложения		= Перечисления.ВидыПриложений[ДанныеЗапроса.appType];
	ТокенОбъект.ОперационнаяСистема	= Перечисления.ОперационныеСистемы[ДанныеЗапроса.systemType];
	ТокенОбъект.Записать();	
	ПланыОбмена.ЗарегистрироватьИзменения(ОбщегоНазначенияПовторноеИспользование.УзелРегистрацияПользователя(Перечисления.ТипыРегистрации.Регистрация), Пользователь);
	Возврат ТокенОбъект;
КонецФункции

Функция ЗаблокироватьТокенПользователя(Токен) Экспорт
	
	ТокенОбъект	= Токен.ПолучитьОбъект();
	ТокенОбъект.ДатаБлокировки	= УниверсальноеВремя(ТекущаяДата());
	ТокенОбъект.Записать();	
	
	Запись	= РегистрыСведений.ЗарегистрированныеУстройства.СоздатьМенеджерЗаписи();
	Запись.Токен	= Токен;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;	
	ПланыОбмена.ЗарегистрироватьИзменения(ОбщегоНазначенияПовторноеИспользование.УзелРегистрацияПользователя(Перечисления.ТипыРегистрации.Регистрация), ТокенОбъект.Пользователь);
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("НаименованиеПолное");
	Поля = ПоляПредставления;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление	= Данные.НаименованиеПолное;
КонецПроцедуры
